nxp-mcuxpresso/mcux-sdk-examples/mimxrt700evk/driver_examples/i3c/interrupt_b2b_transfer/slave/cm33_core1/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT798S
package_id: MIMXRT798SGFOA
mcu_data: ksdk2_0
processor_version: 0.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core1, enableClock: 'true'}
- pin_list:
  - {pin_num: R10, peripheral: LP_FLEXCOMM19, signal: P0, pin_signal: PIO8_14/LP_FLEXCOMM19_P0/CTIMER7_MAT2/SAI3_TX_SYNC/I3C2_SDA, input_buffer: enable}
  - {pin_num: T10, peripheral: LP_FLEXCOMM19, signal: P1, pin_signal: PIO8_15/LP_FLEXCOMM19_P1/CTIMER7_MAT3/SAI3_TX_BCLK/I3C2_SCL, input_buffer: disable}
  - {pin_num: T8, peripheral: I3C3, signal: PUR, pin_signal: PIO8_20/LP_FLEXCOMM19_P6/CTIMER_S_INP7/UTICK1_CAP2/I3C3_PUR, input_buffer: enable, full_drive: Full}
  - {pin_num: N9, peripheral: I3C3, signal: SCL, pin_signal: PIO8_22/LP_FLEXCOMM20_P4/CTIMER5_MAT1/LP_FLEXCOMM3_P1/I3C3_SCL, slew_rate: slow, input_buffer: enable,
    full_drive: Full}
  - {pin_num: R9, peripheral: I3C3, signal: SDA, pin_signal: PIO8_21/LP_FLEXCOMM20_P3/CTIMER5_MAT0/LP_FLEXCOMM3_P0/I3C3_SDA, input_buffer: enable, full_drive: Full}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #1) */
void BOARD_InitPins(void)
{
    /* Reset IOPCTL1 module */
    RESET_ClearPeripheralReset(kIOPCTL1_RST_SHIFT_RSTn);

    const uint32_t port8_pin14_config = (/* Pin is configured as LP_FLEXCOMM19_P0 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT8 PIN14 (coords: R10) is configured as LP_FLEXCOMM19_P0 */
    IOPCTL_PinMuxSet(8U, 14U, port8_pin14_config);

    const uint32_t port8_pin15_config = (/* Pin is configured as LP_FLEXCOMM19_P1 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Disable input buffer function */
                                         IOPCTL_PIO_INBUF_DI |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Normal drive */
                                         IOPCTL_PIO_FULLDRIVE_DI |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT8 PIN15 (coords: T10) is configured as LP_FLEXCOMM19_P1 */
    IOPCTL_PinMuxSet(8U, 15U, port8_pin15_config);

    const uint32_t port8_pin20_config = (/* Pin is configured as I3C3_PUR */
                                         IOPCTL_PIO_FUNC4 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Full drive enable */
                                         IOPCTL_PIO_FULLDRIVE_EN |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT8 PIN20 (coords: T8) is configured as I3C3_PUR */
    IOPCTL_PinMuxSet(8U, 20U, port8_pin20_config);

    const uint32_t port8_pin21_config = (/* Pin is configured as I3C3_SDA */
                                         IOPCTL_PIO_FUNC4 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Normal mode */
                                         IOPCTL_PIO_SLEW_RATE_NORMAL |
                                         /* Full drive enable */
                                         IOPCTL_PIO_FULLDRIVE_EN |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT8 PIN21 (coords: R9) is configured as I3C3_SDA */
    IOPCTL_PinMuxSet(8U, 21U, port8_pin21_config);

    const uint32_t port8_pin22_config = (/* Pin is configured as I3C3_SCL */
                                         IOPCTL_PIO_FUNC4 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Slow mode */
                                         IOPCTL_PIO_SLEW_RATE_SLOW |
                                         /* Full drive enable */
                                         IOPCTL_PIO_FULLDRIVE_EN |
                                         /* Analog mux is disabled */
                                         IOPCTL_PIO_ANAMUX_DI |
                                         /* Pseudo Output Drain is disabled */
                                         IOPCTL_PIO_PSEDRAIN_DI |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI);
    /* PORT8 PIN22 (coords: N9) is configured as I3C3_SCL */
    IOPCTL_PinMuxSet(8U, 22U, port8_pin22_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
